{
    "experiment_type": "Fine-tuning LZV",
    "base_asl_model_path": "c:\\Users\\liene\\Documents\\GitHub\\LZV-CSLR\\models\\asl\\42\\cslr_model_best_42.keras",
    "experiment_index": 1,
    "timestamp_completed_utc": "2025-05-30T15:31:16+00:00",
    "dataset_info": {
        "name": "LZV",
        "training_samples_final_filtered": 254,
        "validation_samples_final_filtered": 64,
        "total_classes_lzv_excl_blank": 45,
        "total_classes_lzv_incl_blank": 46,
        "char_map_file": "data\\processed_landmarks\\char_map.json",
        "train_tfrecord": "training.tfrecord",
        "val_tfrecord": "validation.tfrecord"
    },
    "landmark_info": {
        "source": "MediaPipe Holistic",
        "original_total_landmarks": 543,
        "used_landmarks_count": 42,
        "dimensions": 3
    },
    "preprocessing": {
        "normalization_source": "calculated_on_the_spot",
        "ctc_length_filter_applied": true
    },
    "augmentation_details": {
        "enabled": true,
        "spatial_affine": true,
        "horizontal_flip": false,
        "temporal_resample": true,
        "temporal_mask": true
    },
    "model_architecture_fine_tuned": {
        "config": {
            "name": "cslr_lzv_fine_tune_training_model",
            "trainable": true,
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_shape": [
                            null,
                            null,
                            42,
                            3
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input_landmarks"
                    },
                    "registered_name": null,
                    "name": "input_landmarks",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "Reshape",
                    "config": {
                        "name": "reshape_input",
                        "trainable": false,
                        "dtype": {
                            "module": "keras",
                            "class_name": "DTypePolicy",
                            "config": {
                                "name": "float32"
                            },
                            "registered_name": null
                        },
                        "target_shape": [
                            -1,
                            126
                        ]
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            null,
                            42,
                            3
                        ]
                    },
                    "name": "reshape_input",
                    "inbound_nodes": [
                        {
                            "args": [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            null,
                                            42,
                                            3
                                        ],
                                        "dtype": "float32",
                                        "keras_history": [
                                            "input_landmarks",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ],
                            "kwargs": {}
                        }
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv1D",
                    "config": {
                        "name": "conv1d_layer",
                        "trainable": true,
                        "dtype": {
                            "module": "keras",
                            "class_name": "DTypePolicy",
                            "config": {
                                "name": "float32"
                            },
                            "registered_name": null
                        },
                        "filters": 128,
                        "kernel_size": [
                            5
                        ],
                        "strides": [
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            null,
                            126
                        ]
                    },
                    "name": "conv1d_layer",
                    "inbound_nodes": [
                        {
                            "args": [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            null,
                                            126
                                        ],
                                        "dtype": "float32",
                                        "keras_history": [
                                            "reshape_input",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ],
                            "kwargs": {}
                        }
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "BatchNormalization",
                    "config": {
                        "name": "batchnorm_conv",
                        "trainable": true,
                        "dtype": {
                            "module": "keras",
                            "class_name": "DTypePolicy",
                            "config": {
                                "name": "float32"
                            },
                            "registered_name": null
                        },
                        "axis": -1,
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "gamma_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Ones",
                            "config": {},
                            "registered_name": null
                        },
                        "moving_mean_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "moving_variance_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Ones",
                            "config": {},
                            "registered_name": null
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null,
                        "synchronized": false
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            null,
                            128
                        ]
                    },
                    "name": "batchnorm_conv",
                    "inbound_nodes": [
                        {
                            "args": [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            null,
                                            128
                                        ],
                                        "dtype": "float32",
                                        "keras_history": [
                                            "conv1d_layer",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ],
                            "kwargs": {
                                "mask": null
                            }
                        }
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Bidirectional",
                    "config": {
                        "name": "bilstm_1",
                        "trainable": true,
                        "dtype": {
                            "module": "keras",
                            "class_name": "DTypePolicy",
                            "config": {
                                "name": "float32"
                            },
                            "registered_name": null
                        },
                        "merge_mode": "concat",
                        "layer": {
                            "module": "keras.layers",
                            "class_name": "LSTM",
                            "config": {
                                "name": "forward_lstm",
                                "trainable": true,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "float32"
                                    },
                                    "registered_name": null
                                },
                                "return_sequences": true,
                                "return_state": false,
                                "go_backwards": false,
                                "stateful": false,
                                "unroll": false,
                                "zero_output_for_mask": true,
                                "units": 64,
                                "activation": "tanh",
                                "recurrent_activation": "sigmoid",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "recurrent_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "OrthogonalInitializer",
                                    "config": {
                                        "seed": null,
                                        "gain": 1.0
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "unit_forget_bias": true,
                                "kernel_regularizer": null,
                                "recurrent_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "recurrent_constraint": null,
                                "bias_constraint": null,
                                "dropout": 0.0,
                                "recurrent_dropout": 0.0,
                                "seed": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    null,
                                    128
                                ]
                            }
                        },
                        "backward_layer": {
                            "module": "keras.layers",
                            "class_name": "LSTM",
                            "config": {
                                "name": "backward_lstm",
                                "trainable": true,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "float32"
                                    },
                                    "registered_name": null
                                },
                                "return_sequences": true,
                                "return_state": false,
                                "go_backwards": true,
                                "stateful": false,
                                "unroll": false,
                                "zero_output_for_mask": true,
                                "units": 64,
                                "activation": "tanh",
                                "recurrent_activation": "sigmoid",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "recurrent_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "OrthogonalInitializer",
                                    "config": {
                                        "seed": null,
                                        "gain": 1.0
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "unit_forget_bias": true,
                                "kernel_regularizer": null,
                                "recurrent_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "recurrent_constraint": null,
                                "bias_constraint": null,
                                "dropout": 0.0,
                                "recurrent_dropout": 0.0,
                                "seed": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    null,
                                    128
                                ]
                            }
                        }
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            null,
                            128
                        ]
                    },
                    "name": "bilstm_1",
                    "inbound_nodes": [
                        {
                            "args": [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            null,
                                            128
                                        ],
                                        "dtype": "float32",
                                        "keras_history": [
                                            "batchnorm_conv",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ],
                            "kwargs": {
                                "mask": null
                            }
                        }
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "BatchNormalization",
                    "config": {
                        "name": "batchnorm_lstm1",
                        "trainable": true,
                        "dtype": {
                            "module": "keras",
                            "class_name": "DTypePolicy",
                            "config": {
                                "name": "float32"
                            },
                            "registered_name": null
                        },
                        "axis": -1,
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "gamma_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Ones",
                            "config": {},
                            "registered_name": null
                        },
                        "moving_mean_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "moving_variance_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Ones",
                            "config": {},
                            "registered_name": null
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null,
                        "synchronized": false
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            null,
                            128
                        ]
                    },
                    "name": "batchnorm_lstm1",
                    "inbound_nodes": [
                        {
                            "args": [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            null,
                                            128
                                        ],
                                        "dtype": "float32",
                                        "keras_history": [
                                            "bilstm_1",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ],
                            "kwargs": {
                                "mask": null
                            }
                        }
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_shape": [
                            null,
                            1
                        ],
                        "dtype": "int64",
                        "sparse": false,
                        "name": "input_landmark_length_lzv"
                    },
                    "registered_name": null,
                    "name": "input_landmark_length_lzv",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_shape": [
                            null,
                            1
                        ],
                        "dtype": "int64",
                        "sparse": false,
                        "name": "input_label_length_lzv"
                    },
                    "registered_name": null,
                    "name": "input_label_length_lzv",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_shape": [
                            null,
                            null
                        ],
                        "dtype": "int64",
                        "sparse": false,
                        "name": "input_labels_lzv"
                    },
                    "registered_name": null,
                    "name": "input_labels_lzv",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "TimeDistributed",
                    "config": {
                        "name": "output_dense_softmax_lzv",
                        "trainable": true,
                        "dtype": {
                            "module": "keras",
                            "class_name": "DTypePolicy",
                            "config": {
                                "name": "float32"
                            },
                            "registered_name": null
                        },
                        "layer": {
                            "module": "keras.layers",
                            "class_name": "Dense",
                            "config": {
                                "name": "dense_1",
                                "trainable": true,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "float32"
                                    },
                                    "registered_name": null
                                },
                                "units": 46,
                                "activation": "softmax",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    128
                                ]
                            }
                        }
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            null,
                            128
                        ]
                    },
                    "name": "output_dense_softmax_lzv",
                    "inbound_nodes": [
                        {
                            "args": [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            null,
                                            128
                                        ],
                                        "dtype": "float32",
                                        "keras_history": [
                                            "batchnorm_lstm1",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ],
                            "kwargs": {
                                "mask": null
                            }
                        }
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Lambda",
                    "config": {
                        "name": "squeeze_lm_len_lzv",
                        "trainable": true,
                        "dtype": {
                            "module": "keras",
                            "class_name": "DTypePolicy",
                            "config": {
                                "name": "float32"
                            },
                            "registered_name": null
                        },
                        "function": {
                            "class_name": "__lambda__",
                            "config": {
                                "code": "4wEAAAAAAAAAAAAAAAQAAAATAAAA8zoAAACXAHQAAAAAAAAAAAAAAKABAAAAAAAAAAAAAAAAAAAA\nAAAAAAB8AGQBrAKmAgAAqwIAAAAAAAAAAFMAqQNO6f////+pAdoEYXhpc6kC2gJ0ZtoHc3F1ZWV6\nZakB2gF0cwEAAAAg+j9DOi9Vc2Vycy9saWVuZS9BcHBEYXRhL0xvY2FsL1RlbXAvaXB5a2VybmVs\nXzIzODEyLzE4MjQ4MzMwNzkucHn6CDxsYW1iZGE++ixidWlsZF9jc2xyX2ZpbmVfdHVuZV9tb2Rl\nbC48bG9jYWxzPi48bGFtYmRhPmsAAABzFgAAAIAAvTK/Oro6wGHIYrg60TtR1DtRgADzAAAAAA==\n",
                                "defaults": null,
                                "closure": null
                            }
                        },
                        "arguments": {}
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            1
                        ]
                    },
                    "name": "squeeze_lm_len_lzv",
                    "inbound_nodes": [
                        {
                            "args": [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            1
                                        ],
                                        "dtype": "int64",
                                        "keras_history": [
                                            "input_landmark_length_lzv",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ],
                            "kwargs": {
                                "mask": null
                            }
                        }
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Lambda",
                    "config": {
                        "name": "squeeze_ph_len_lzv",
                        "trainable": true,
                        "dtype": {
                            "module": "keras",
                            "class_name": "DTypePolicy",
                            "config": {
                                "name": "float32"
                            },
                            "registered_name": null
                        },
                        "function": {
                            "class_name": "__lambda__",
                            "config": {
                                "code": "4wEAAAAAAAAAAAAAAAQAAAATAAAA8zoAAACXAHQAAAAAAAAAAAAAAKABAAAAAAAAAAAAAAAAAAAA\nAAAAAAB8AGQBrAKmAgAAqwIAAAAAAAAAAFMAqQNO6f////+pAdoEYXhpc6kC2gJ0ZtoHc3F1ZWV6\nZakB2gF0cwEAAAAg+j9DOi9Vc2Vycy9saWVuZS9BcHBEYXRhL0xvY2FsL1RlbXAvaXB5a2VybmVs\nXzIzODEyLzE4MjQ4MzMwNzkucHn6CDxsYW1iZGE++ixidWlsZF9jc2xyX2ZpbmVfdHVuZV9tb2Rl\nbC48bG9jYWxzPi48bGFtYmRhPmwAAABzFgAAAIAAvQK/CroKwDHIMrgK0ThO1DhOgADzAAAAAA==\n",
                                "defaults": null,
                                "closure": null
                            }
                        },
                        "arguments": {}
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            1
                        ]
                    },
                    "name": "squeeze_ph_len_lzv",
                    "inbound_nodes": [
                        {
                            "args": [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            1
                                        ],
                                        "dtype": "int64",
                                        "keras_history": [
                                            "input_label_length_lzv",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ],
                            "kwargs": {
                                "mask": null
                            }
                        }
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Lambda",
                    "config": {
                        "name": "ctc_loss_lzv",
                        "trainable": true,
                        "dtype": {
                            "module": "keras",
                            "class_name": "DTypePolicy",
                            "config": {
                                "name": "float32"
                            },
                            "registered_name": null
                        },
                        "function": {
                            "class_name": "__lambda__",
                            "config": {
                                "code": "4wEAAAAAAAAAAAAAAAkAAAATAAAA8+oAAACXAHQAAAAAAAAAAAAAAGoBAAAAAAAAAABqAgAAAAAA\nAAAAoAMAAAAAAAAAAAAAAAAAAAAAAAAAAHwAZAEZAAAAAAAAAAAAfABkAhkAAAAAAAAAAAB0AAAA\nAAAAAAAAAACgBAAAAAAAAAAAAAAAAAAAAAAAAAAAfABkAxkAAAAAAAAAAABkBKwFpgIAAKsCAAAA\nAAAAAAB0AAAAAAAAAAAAAACgBAAAAAAAAAAAAAAAAAAAAAAAAAAAfABkBhkAAAAAAAAAAABkBKwF\npgIAAKsCAAAAAAAAAACsB6YEAACrBAAAAAAAAAAAUwApCE7pAAAAAOkBAAAA6QIAAADp/////6kB\n2gRheGlz6QMAAAApBNoGeV90cnVl2gZ5X3ByZWTaDGlucHV0X2xlbmd0aNoMbGFiZWxfbGVuZ3Ro\nKQXaAnRm2gVrZXJhc9oHYmFja2VuZNoOY3RjX2JhdGNoX2Nvc3TaC2V4cGFuZF9kaW1zKQHaBGFy\nZ3NzAQAAACD6P0M6L1VzZXJzL2xpZW5lL0FwcERhdGEvTG9jYWwvVGVtcC9pcHlrZXJuZWxfMjM4\nMTIvMTgyNDgzMzA3OS5wefoIPGxhbWJkYT76LGJ1aWxkX2NzbHJfZmluZV90dW5lX21vZGVsLjxs\nb2NhbHM+LjxsYW1iZGE+bwAAAHNeAAAAgACVUpRY1BUl1xU00hU02BMXmAGUN6A0qAGkN90ZG58e\nmh6oBKhRrAewYpge0Rk51Bk5zQLPDsoO0Fdb0C9d1Fde0GVnyA7RSGjUSGjwBQAWNfEAAxYK9AAD\nFgqAAPMAAAAA\n",
                                "defaults": null,
                                "closure": null
                            }
                        },
                        "arguments": {}
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            [
                                null,
                                null
                            ],
                            [
                                null,
                                null,
                                46
                            ],
                            [
                                null
                            ],
                            [
                                null
                            ]
                        ]
                    },
                    "name": "ctc_loss_lzv",
                    "inbound_nodes": [
                        {
                            "args": [
                                [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                null
                                            ],
                                            "dtype": "int64",
                                            "keras_history": [
                                                "input_labels_lzv",
                                                0,
                                                0
                                            ]
                                        }
                                    },
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                null,
                                                46
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "output_dense_softmax_lzv",
                                                0,
                                                0
                                            ]
                                        }
                                    },
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "squeeze_lm_len_lzv",
                                                0,
                                                0
                                            ]
                                        }
                                    },
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "squeeze_ph_len_lzv",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ]
                            ],
                            "kwargs": {
                                "mask": [
                                    null,
                                    null,
                                    null,
                                    null
                                ]
                            }
                        }
                    ]
                }
            ],
            "input_layers": {
                "input_landmarks": [
                    "input_landmarks",
                    0,
                    0
                ],
                "input_labels": [
                    "input_labels_lzv",
                    0,
                    0
                ],
                "input_landmark_length": [
                    "input_landmark_length_lzv",
                    0,
                    0
                ],
                "input_label_length": [
                    "input_label_length_lzv",
                    0,
                    0
                ]
            },
            "output_layers": [
                [
                    "ctc_loss_lzv",
                    0,
                    0
                ]
            ]
        },
        "params_total": 186542,
        "params_trainable": 186030
    },
    "results": {
        "best_val_wer_overall": 0.20666666666666667,
        "best_val_wer_epoch_overall": 70,
        "final_train_loss": 2.004436731338501,
        "final_val_wer": 0.21666666666666667,
        "epoch_metrics": [
            {
                "epoch": 1,
                "loss": 206.20648193359375,
                "val_loss": 26.54610824584961,
                "val_wer": 1.52,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 2,
                "loss": 34.10596466064453,
                "val_loss": 15.602439880371094,
                "val_wer": 1.3566666666666667,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 3,
                "loss": 24.33619499206543,
                "val_loss": 10.465883255004883,
                "val_wer": 2.3733333333333335,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 4,
                "loss": 19.343950271606445,
                "val_loss": 8.105584144592285,
                "val_wer": 2.1433333333333335,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 5,
                "loss": 13.173686027526855,
                "val_loss": 7.240564346313477,
                "val_wer": 1.8233333333333333,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 6,
                "loss": 11.042464256286621,
                "val_loss": 6.450219631195068,
                "val_wer": 1.02,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 7,
                "loss": 9.674126625061035,
                "val_loss": 5.698976516723633,
                "val_wer": 0.8633333333333333,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 8,
                "loss": 8.771221160888672,
                "val_loss": 5.446804046630859,
                "val_wer": 0.8233333333333334,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 9,
                "loss": 7.1685662269592285,
                "val_loss": 5.654796600341797,
                "val_wer": 0.8633333333333333,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 10,
                "loss": 6.703371047973633,
                "val_loss": 5.305193901062012,
                "val_wer": 0.6266666666666667,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 11,
                "loss": 6.120894908905029,
                "val_loss": 5.412588119506836,
                "val_wer": 0.54,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 12,
                "loss": 5.942758083343506,
                "val_loss": 5.174802303314209,
                "val_wer": 0.4666666666666667,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 13,
                "loss": 5.186604976654053,
                "val_loss": 5.481748104095459,
                "val_wer": 0.41,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 14,
                "loss": 4.853175640106201,
                "val_loss": 5.052728652954102,
                "val_wer": 0.5,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 15,
                "loss": 4.819790363311768,
                "val_loss": 5.6814775466918945,
                "val_wer": 0.37666666666666665,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 16,
                "loss": 4.3741679191589355,
                "val_loss": 4.822079658508301,
                "val_wer": 0.58,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 17,
                "loss": 4.304736137390137,
                "val_loss": 5.341893196105957,
                "val_wer": 0.35,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 18,
                "loss": 4.056751251220703,
                "val_loss": 5.502028942108154,
                "val_wer": 0.4633333333333333,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 19,
                "loss": 4.121574878692627,
                "val_loss": 5.735354900360107,
                "val_wer": 0.2966666666666667,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 20,
                "loss": 3.7452774047851562,
                "val_loss": 5.343857765197754,
                "val_wer": 2.92,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 21,
                "loss": 3.3568735122680664,
                "val_loss": 4.8929877281188965,
                "val_wer": 0.29,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 22,
                "loss": 3.181058406829834,
                "val_loss": 5.046799659729004,
                "val_wer": 0.2866666666666667,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 23,
                "loss": 3.0942695140838623,
                "val_loss": 5.149197101593018,
                "val_wer": 0.2866666666666667,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 24,
                "loss": 2.976198196411133,
                "val_loss": 5.064435958862305,
                "val_wer": 0.25333333333333335,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 25,
                "loss": 2.7827887535095215,
                "val_loss": 5.003209590911865,
                "val_wer": 0.26,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 26,
                "loss": 2.7701001167297363,
                "val_loss": 4.9690842628479,
                "val_wer": 0.25666666666666665,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 27,
                "loss": 2.894383668899536,
                "val_loss": 4.9692816734313965,
                "val_wer": 0.25333333333333335,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 28,
                "loss": 2.648350477218628,
                "val_loss": 4.969820499420166,
                "val_wer": 0.24333333333333335,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 29,
                "loss": 2.5926449298858643,
                "val_loss": 4.929688453674316,
                "val_wer": 0.25333333333333335,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 30,
                "loss": 2.8468525409698486,
                "val_loss": 4.97042989730835,
                "val_wer": 0.27,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 31,
                "loss": 2.6271915435791016,
                "val_loss": 4.9832563400268555,
                "val_wer": 0.25333333333333335,
                "lr": 0.0010000000474974513
            },
            {
                "epoch": 32,
                "loss": 2.452608823776245,
                "val_loss": 4.9857635498046875,
                "val_wer": 0.22,
